{"numbered":true,"items":[
{"thumb":"/covers/39.webp","title":"Monolithic Torment Forever - Monolithic Torment Forever (32:03:36)","desc":"32 hour long tribute album made in the memory of HNW artist Emily Aideen. (aka MONOLITHIC TORMENT, Submachine Gun, Throat cut fucker and other names) All artists on this compilation where inspired by Emily in some way or another and came together to create this 32 hour long HNW masterpiece. Will probably stay as my favourite HNW album forever, I don't really see how anything can top this"},
{"thumb":"/covers/155.webp","title":"BCE #1000 - Various Artists (30:52:37)","desc":"The 1000th release on the net label Basement Corner Emissions, which is made up of tracks by artists who have contributed to the label in the past. Overall this release wasnt the best thing ever, it was pretty cool but it got a bit tiring towards the end of listening so much so that i couldnt finish the album the first time i tried listening and had to come back later. I found this album through searching xfeverfewx's (she has featured on BCE and BCE #1000)"},
{"thumb":"/covers/156.webp","title":"028: Even to the Edge of Doom - Bull of Heaven (24:00:00)","desc":"Probably the most accessible long BoH release, whilst it is mostly the same droning noise for a full 24 hours, that doesnt mean its dogshit, the looping drone is really pretty and every few hours it throws in like 5 minutes of other stuff and the drone changes a bit before going back to normal, not much to say about this one other than that its a really pretty release"},
{"thumb":"/covers/157.webp","title":"Major Demon: YMHSVL - Yotzeret Sheydim (24:00:00)","desc":"Yotzeret Sheydim's longest release to date is a 24 hour album noise album recorded entirely in one take. It also has a cassette boxset release with 16 c90s, a copper sigil bracelet and notes scroll. The album is dedicated to a free Palestine"},
{"thumb":"/covers/184.webp","title":"Toy Motion - Floret (15:05:54)","desc":"Another one of the really long side onlose albums and it might be the longest? Idk... it's a 15 HOUR long drone / ambient album with some crazy track lengths (9:15:55 at longest) which is kinda nuts, has some really really pretty drones in it and it really transfixed me at times, but it didnt quite get a 4 because there were a couple tracks which were not that great. NOTE: the 9 hour track is shortened to 1 hour 40 on bandcamp and i was given the 9 hour ver by someone in charge of the label"},
{"thumb":"/covers/334.webp","title":"approaching infinities (2019-2023) - Evelyn Luvtell(12:49:45)","desc":"Collection of lots of single tracks that Evelyn released from... 2019 to 2023... it's pretty interesting and has a couple really good tracks in it, introduced me to some amazing albums that I really liked but overall its of course not too cohesive, that doesn't really matter too much and i quite like it"},
{"thumb":"/covers/158.webp","title":"ריקוד המוות - Bishop - Yotzeret Sheydim (12:05:13)","desc":"Im not really sure what there is to say about this, what the album is supposed to be about is fairly unclear and i dont understand it too much, features sampling of a feminist bible interpretation from 1979 called Woman Power but its mainly HNW"},
{"thumb":"/covers/159.webp","title":"We Love To Dance, We Love To Die - Yotzeret Sheydim (11:37:43)","desc":"Another mega long Yotzeret Sheydim release, this one is similar to the bishop and heathen except it doesnt sample anything and is just a pure recording direct to tape, as such the digital version of this file is a cassette rip and the only original recording is on the single edition tape boxset"},
{"thumb":"/covers/160.webp","title":"Hello Noise Wall: Complete - Hello Noise Wall (9:57:58)","desc":"The other Emily Aideen dedicated HNW compilation, also organised by Yotzeret Sheydim. The first two tracks on this compilation are by Emily, every artist featured has two tracks on this album, with 12 artists and 24 tracks, each going from anywhere between 10 minutes to 45 minutes"},
{"thumb":"/covers/161.webp","title":"ר​י​ק​ו​ד ה​מ​ו​ו​ת - Heathen - Yotzeret Sheydim (8:22:17)", "desc":"The other album that goes with Bishop, similar sort of sound and theming. The entire album is recorded directly onto tape over an audiobook recording of Deep Range by Arthur C Clarke, and the audio was recorded with no input feedback loops"},
{"thumb":"/covers/162.webp","title":"019: Hypnosis, Drugs, and Mind Control (The Beginning: A Touch) - Bull of Heaven (8:00:00)","desc":"8 hour early BoH release that features a drum beat sort of thing that doesnt change toooo much in the 8 hour runtime, similarly to 028 however it does have different changing sections when the beat changes up a little but it mainly focuses around the same beat throughout"},
{"thumb":"/covers/163.webp","title":"Transmutation Experiments: Aleph - Yod - Yotzeret Sheydim (7:30:07)","desc":"Really interesting Yotzeret Sheydim release due to the fact that the physical release costs $1000 dollars due to also coming with a large copper wire tree in which the cassettes containing the audio are on. There is also a 'failed' version on a single c0 (??) tape which is punctured with a thick copper wire. Each track was produced with a variety of different sources."},
{"thumb":"/covers/137.webp","title":"Daughter of Darkness - Natural Snow Buildings (7:21:10)","desc":"The classic long album... really beautiful concept album about demons taking over the earth with a massive range of sounds and atmospheres throughout. Towards the end of the album especially some really amazing tracks come into play such as Black Pastures and Devil's Fork. Also the longest album that I have on physical"},
{"thumb":"/covers/210.webp","title":"Compilation II: Noise for Trans Lives - Ripping Nails Records (6:54:45)","desc":"This album has been in my backlog since FOREVER!! A few days ago i decided to finally listen to it though and got it done in 2 days which im quite happy with, despite the title this is NOT completely noise music, theres alot of really weird stuff and mix of genres in here but unfortunately I felt that the vibes just wheren't quite there, and I gave it a 3 because it did have it's moments and a few really interesting tracks but its generally a bit mushy"},
{"thumb":"/covers/273.webp","title":"claustrophile: acts 1-3 - Halcyon 14th (6:50:48)","desc":"Oh hell yeah now we are at the pinacle of furry noise music, we got vore themed whatever this is, sometimes it's noise and sometimes it's some sort of ambient droney thing and some other things, for what it is (vore music) it's actually an incredibly charming and well made album inspired by Patricia Taxxon's techdog series, it definitely keeps a similar vibe I feel, and the progression is similar... Really amazing album here"},
{"thumb":"/covers/164.webp","title":"Stainless Steel Love - Chainlink Mistress (6:01:49)","desc":"Very interesting album in concept but not so much when it comes to the actual audio which i suppose makes sense... a 6 hour noise wall which was recorded during sex and then released on VHS with the audio, the VHS recording is heavily digitally manipulated to the extent that nothing in the recording is identifiable at all"},
{"thumb":"/covers/166.webp","title":"Aldebaran - Natural Snow Buildings (5:42:37)","desc":"Natural Snow Buildings' second longest album after DoD, not nearly as interesting as DoD but its still a cool listen with some really nice droning tracks, can't really remember much about this one unfortunately other than it was droney and i liked it a bit"},
{"thumb":"/covers/170.webp","title":"226 - Vignette (5:19:47)","desc":"MY VERY OWN DEBUT ALBUM, for this one i dont really think i would call it good just because its my own... its got alot going on definitely and i think i did a good job making a cool album but since its my own i will refrain from giving it a rating because that would feel weird. Either way its quite long"},
{"thumb":"/covers/251.webp","title":"Behind the Cloud Horizon - Tuluum Shimmering (4:40:33)","desc":"Rather long Tuluum Shimmering album, I don't really think that this one is that great, just because I feel that the tracks tend to blend into each other, especially for discs 1 and 2, discs 3 and 4 are great but are really pulled down quite a bit. Scores a high 3 because of the second half being pretty awesome"},
{"thumb":"/covers/50.webp","title":"TECHDOG 7 - Patricia Taxxon (4:33:10)","desc":"My favourite album of all time. Features some of the best drone and ambient in my entire collection that has made me cry definitely more than once. Amazingly beautiful album that even for its lengthy runtime feels incredibly fresh and easy to listen to, as well as being incredibly emotionally charged and moving. I adore absolutely everything about this album and don't think it will ever fall into second favourite"},
{"thumb":"/covers/178.webp","title":"A State of Yan - janis lago (4:28:37)","desc":"the longest janis lago release there is so far, listened to this just because of that and its really good i like it alot, it wouldve scored much higher i feel if it felt like a full album rather than a loud of tracks lumped together, idk how to describe why it feels like that but it just does, regardless the individual tracks are great and its a really cool and interesting album that u should listen to if you like janis' music"},
{"thumb":"/covers/150.webp","title":"long way home - Silver Dove (4:27:10)","desc":"Strange super minimalist album that im not really sure how to describe the album. Most of the album is taken up by these quiet clicking noises with slight echo, but over the tracks gradually builds up some more small but noticable differences. At the 3 hour mark however, it turns into this amazing drone piece for the second half of the second to last track, before turning back into a weird minimalistic outro for the last track. All the tracks have the same title"},
{"thumb":"/covers/358.webp","title":"კონტაქტის წინა მომენტი - ცოდნის მფლობელები (4:10:00)","desc":"Nice awesome textural HNW album from this georgian guy that i know about because of BCE#1000, listened on a whim and it turned out to be a really cool and interesting listen i loved it very much :))))))))"},
{"thumb":"/covers/256.webp","title":"I've got a lot on my mind. - Angel B. (4:00:00)","desc":"4 hour long HNW album in 4 parts, morning, afternoon, evening and night, each one hour long. Pretty cool HNW album that I listened to as a sort of introduction to Angel's work and I think it was pretty nice, not as good as her stuff under narehate though.."},
{"thumb":"/covers/81.webp","title":"Sun Bird - Tuluum Shimmering (3:59:42)","desc":"Super pretty folk album that I have on a really cool 4x cd, very pleasant easy listening that is nice to put on whilst you are doing something else, generally one of the more accessible albums on this list also (my parents kind of liked it??????) Definitely give a listen if you like NSB, Tuluum Shimmering is the happy equivalent of NSB in my eyes"},
{"thumb":"/covers/119.webp","title":"A transgender woman surviving. - Thoughts of ending it all. - A broken [...] - Yotzeret Sheydim (3:54:36)","desc":"My second favourite harsh noise wall album... not fully harsh noise wall but it is mainly, has some absolutely wonderful textures and one of the best outro tracks in any album ive listened to. features 6 half hour hnw tracks seperated in groups of 3 by various harsh noise / dungeon synth tracks"},
{"thumb":"/covers/197.webp","title":"from - Silver Dove (3:14:50)","desc":"Listening to this right now, not really sure why I like this so much but it just feels like a reaaaally good sort of 'traditional' noise wall, in the sense that its just a huge wall of noise without anything else, very little variation in this but i like it quite a bit, good for blasting your head off if you feel the desire to do so"},
{"thumb":"/covers/167.webp","title":"Sounds of Vagrancy - Emily Aideen (3:14:21)","desc":"My favourite Emily Aideen album, has some really cool ideas at play in this one, I don't know alot about this album for certain but from how the audio sounds it was recorded as a vagrant, some sounds in particular sound very much like rain on a tent rood and theres also zipper sounds too"},
{"thumb":"/covers/176.webp","title":"OVERBEARER, THE TRAITOR, THE [...] - OVERBEARER, THE TRAITOR, THE HELLISH DOG. (3:10:59)","desc":"This one is a really interesting release, listened because I've been eyeing up the cover for a while and someone in side onlose discord liked it so i listened to it and its pretty great, mixes lots of different things into itself like some weird glitch folk stuff and also noise sections and spoken word and overall u gotta listen to it urself to get it, its amazing"},
{"thumb":"/covers/168.webp","title":"106: Let's Murder the Neighbors - Bull of Heaven (3:05:48}","desc":"Looong Bull of Heaven harsh noise, it was kind of cool and i really dont have much to say about it but it was my first sort of taste of harsh noise so it holds a special place to me even if its not actually that good of a release"},
{"thumb":"/covers/217.webp","title":"The Air Listens - Robert Scott Thompson (3:01:36)","desc":"Long drone album that I listened to a while back because i thought the cover was cool, whilst I can appreciate that it was a decent drone it just felt incredibly boring for some reason, not really sure why but its the lowest ranking album on here because it's so boring"},
{"thumb":"/covers/169.webp","title":"We Know Time - Various Artists (3:00:36)","desc":"Strange compilation album that featured Agog, and thats the only reason i listened to it. Has some pretty cool moments and its a pretty solid release but i dont really find it to be that memorable despite all this. Probably the longest thing Agog has featured on"}
]}
