{"numbered":true,"items":[
{"thumb":"/covers/50.webp","title":"TECHDOG 7 - Patricia Taxxon","desc":"Very special album for me... Found this a little before I went away to be at uni and holy FUCK this is so good... First time hearing Patricia Taxxon's vocals and wow she is so amazing, this entire album manages to so amazingly represent the feeling it goes out to, every single track has something great going for it and the sense of progression the whole album gives before going all out on the last track is so incredible"},
{"thumb":"/covers/63.webp","title":"rivers as human beings - janis lago","desc":"Another album that is really special because of the connotations i have with it paired with the emotional nature of the album, this one I was getting into a week before I was due to leave to see my wife so i have a really strong attachment to it. Whilst it doesnt flow the same way as TECHDOG 7, a few tracks (camisole and briefs & smallest bunny known) clear every track in TECHDOG 7. All the other tracks are incredibly special in their own right but those two are probably my favourite two tracks ever"},
{"thumb":"/covers/126.webp","title":"Horror Vacui - janis lago","desc":"This is kinda linked to rivers as human beings in the sense that i associate it heavily with my wife, I listened to this the day after it came out which happened to be when i was going home from Finland which was a pretty awful (traumatic??) experience and it still makes me cry whenever i think about leaving the train station. The music is absolutely amazing and amor vacui in particular was exactly the track I needed on that day, really incredible how janis consistently puts out such great music"},
{"thumb":"/covers/39.webp","title":"Monolithic Torment Forever - Monolithic Torment Forever","desc":"Very attached to this album mainly because of what it stands for, that being a tribute to Emily Aideen (MONOLITHIC TORMENT) who is a really important artist for me. Whilst it's not something I listen to often, its always a great experience going through the album again because it reminds me why i love HNW as a genre so much. Theres so much variation on the genre in this album and I feel its a perfect example of what HNW is"},
{"thumb":"/covers/42.webp","title":"Magnetic Phenomena of All Kinds - Agog","desc":"The best sound collage album ever made IMO, whilst it wasnt the album that got me into sound collage (Putting Legs on a Snake by Agog) its definitely my favourite album of the genre. Features some really amazing sampling in which everything somehow feels like it should be where it is, even though its a random jumble of sounds from various sources, the musique concrète segments are also perfectly done with Agog's signature style"},
{"thumb":"/covers/119.webp","title":"A transgender woman surviving. - Thoughts of ending it all. - A broken mind tearing [...] - Yotzeret Sheydim","desc":"The second HNW / noise album in the top 10... This one is not really important because of any emotional attachment like MLTF is, but instead for actually how it sounds. The album is esentially 2 groups of 3x 30 minute HNW tracks with some harsh noise tracks between, and one of the best closing songs ever made. Something about the album feels incredibly distressing and sharp and it does what it intends to do amazingly"},
{"thumb":"/covers/237.webp","title":"Birthing - Swans","desc":"Album that got me into swans!!!!!! really fantastic album and i love every single track in this a great deal... but especially i am a tower that song gets me so fucking hyped fuck yeah i love i am a tower and i love this album, my favourite disc is disc one i think but disc two is also filled with bangers and yeah love this incredible awesome wholesome chungus 10/10"},
{"thumb":"/covers/40.webp","title":"I've Seen Better Days - amaii","desc":"I did not think I would like this album at all when I was recommended it by a close friend because its hyperpop and I dont really like hyperpop but uhhhh aparently this is the exception?? Realllly well constructed album with some super fun songs and great sampling too, I am patiently awaiting a new release from this artist because there has been like nothing since this album was released"},
{"thumb":"/covers/38.webp","title":"redemptive light - xfeverfewx","desc":"A very bizarre album in the sense that its barely like anything else i have listened to... really weird folkey kinda feel about it except its also just not... the highlights of this album are the two 10 minute tracks sandwiched inbetween the two 5 minute noise tracks, of course in anais' signature style. i have no idea what i find so special about these two tracks but they just kind of... click with me??? i have no idea why or how but i vibe heavily with for maxwell and body they are simply incredible please listen to this criminaly underrated album"},
{"thumb":"/covers/250.webp","title":"Putting Legs On a Snake - Agog","desc":"My first agog album too wow, whilst its definitely not as good as magnetic phenomena its still fucking amazing and has some incredible sound design, love how energetic this is and its a really really good release im so glad to have this on tape :)))))))"}
]}
